In [1]:
import mysql.connector

In [ ]:
mydb = mysql.connector.connect(
    host="localhost",
    user="root",
    password="1590",
    # database="mydatabase"  # Se quiser criar um novo devemos comentar essa linha 
)

print(mydb)

#### Criando DB

In [ ]:
mycursor = mydb.cursor()

In [ ]:
mycursor.execute("CREATE DATABASE python_conn")

#### Listando os DBs

In [ ]:
mycursor.execute("SHOW DATABASES")

for x in mycursor:
  print(x)

#### Criando tables

To fazendo a conexao dnv porque quero já conectar com o DB

In [2]:
mydb = mysql.connector.connect(
    host="localhost",
    user="root",
    password="1590",
    database="python_conn"
)

print(mydb)

<mysql.connector.connection_cext.CMySQLConnection object at 0x00000000054846D8>

In [3]:
mycursor = mydb.cursor()

In [ ]:
mycursor.execute("CREATE TABLE pessoas (id int auto_increment PRIMARY KEY, nome VARCHAR(50), idade int)")

#### Listando tabelas

In [4]:
mycursor.execute("SHOW TABLES")

for x in mycursor:
  print(x)

('pessoas',)

#### Insert

In [8]:
# mesmo na minha tabela pessoas a idade estando como int, aqui no python a gente tem que passar o %s do mesmo jeito
# mas quando ele entra na tabela ele entra como int
sql = "INSERT INTO pessoas (nome, idade) VALUES (%s, %s)"
val = [
  ('Peter', '5'),
  ('Amy', '8'),
  ('Hannah', '11'),
  ('Michael', '13'),
  ('Sandy', '15'),
  ('Betty', '1'),
  ('Richard', '18'),
  ('Susan', '20'),
  ('Vicky', '25'),
  ('Ben', '37'),
  ('William', '45'),
  ('Chuck', '59'),
  ('Viola', '71')
]

mycursor.executemany(sql, val)

mydb.commit()

print(mycursor.rowcount, "registros inseridos")

13 was inserted.

#### Select

In [24]:
mycursor.execute("SELECT * FROM pessoas")

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

(4, 'Hannah', 11)
(5, 'Michael', 13)
(6, 'Sandy', 15)
(7, 'Betty', 1)
(8, 'Richard', 18)
(9, 'Susan', 20)
(10, 'Vicky', 25)
(11, 'Ben', 37)
(12, 'William', 45)
(13, 'Chuck', 58)
(14, 'Viola', 71)

#### Where

In [11]:
sql = "SELECT nome, idade FROM pessoas WHERE idade > 55"

mycursor.execute(sql)

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

('Chuck', 59)
('Viola', 71)

+ Prevenção contra Injection Query

In [15]:
sql = "SELECT * FROM pessoas WHERE nome = %s"
adr = ("Amy", )

mycursor.execute(sql, adr)

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

(3, 'Amy', 8)

**Order By**

In [17]:
sql = "SELECT * FROM pessoas ORDER BY nome DESC"

mycursor.execute(sql)

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

(12, 'William', 45)
(14, 'Viola', 71)
(10, 'Vicky', 25)
(9, 'Susan', 20)
(6, 'Sandy', 15)
(8, 'Richard', 18)
(2, 'Peter', 5)
(5, 'Michael', 13)
(4, 'Hannah', 11)
(13, 'Chuck', 59)
(7, 'Betty', 1)
(11, 'Ben', 37)
(3, 'Amy', 8)

#### Delete

In [18]:
sql = "DELETE FROM pessoas WHERE idade = 5"

mycursor.execute(sql)

mydb.commit()

print(mycursor.rowcount, "Registro(s) deletado(s)")

1 Registro(s) deletado(s)

+ Prevenção contra Injection Query

In [20]:
sql = "DELETE FROM pessoas WHERE idade = %s"
adr = ("8", )

mycursor.execute(sql, adr)

mydb.commit()

print(mycursor.rowcount, "Registro(s) deletado(s)")

1 Registro(s) deletado(s)

#### Drop table

In [22]:
# coloquei uma tabela que nao existe de proposito
sql = "DROP TABLE IF EXISTS customers"

mycursor.execute(sql)

#### Update

In [23]:
sql = "UPDATE pessoas SET idade = 58 WHERE nome = 'Chuck'"

mycursor.execute(sql)

mydb.commit()

print(mycursor.rowcount, "Registro(s) afetado(s)")

1 Registro(s) afetado(s)

#### Join

In [ ]:
# Não fiz efetivamente porque se nao ia ter que criar outra tabela u.u
sql = "SELECT \
  users.name AS user, \
  products.name AS favorite \
  FROM users \
  INNER JOIN products ON users.fav = products.id"

mycursor.execute(sql)

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

## Uteis
+ Podemos usar o mydb.close() para fechar a conexao com o db

### Só para lembrar, tambem posso ir la no MySQL e exportar para CSV. Só precisamos colocar para o separador ser VIRGULA

In [25]:
import pandas as pd

In [27]:
pd.read_csv('exportado_mysql.csv')

    id     nome  idade
0    4   Hannah     11
1    5  Michael     13
2    6    Sandy     15
3    7    Betty      1
4    8  Richard     18
5    9    Susan     20
6   10    Vicky     25
7   11      Ben     37
8   12  William     45
9   13    Chuck     58
10  14    Viola     71